In [1]:
import pandas as pd

In [43]:
ecx = pd.read_excel('Coffee-2012.xlsx')
ecx.head()

,Trade Date,Symbol,Warehouse,Production Year,Opening Price,Closing Price,High,Low,Change,Persetntage Change,Volume (Ton)
0,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2012-01-02,WYKQ2,BG,2004.0,"1,175.00",0.00,"1,175.00","1,175.00",0.0,0.0,28.29
2,2012-01-03,WYKQ2,BG,2004.0,"1,175.00",0.00,"1,175.00","1,175.00",0.0,0.0,10.80
3,2012-01-04,WYKQ2,BG,2004.0,"1,180.00",0.00,"1,180.00","1,180.00",0.0,0.0,6.61
4,2012-01-06,WYKQ2,BG,2004.0,"1,175.00",0.00,"1,175.00","1,175.00",0.0,0.0,8.99

In [48]:
cecx = ecx.drop(index=[1])
cecx.head()

,Trade Date,Symbol,Warehouse,Production Year,Opening Price,Closing Price,High,Low,Change,Persetntage Change,Volume (Ton)
0,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2012-01-03,WYKQ2,BG,2004.0,"1,175.00",0.00,"1,175.00","1,175.00",0.0,0.0,10.80
3,2012-01-04,WYKQ2,BG,2004.0,"1,180.00",0.00,"1,180.00","1,180.00",0.0,0.0,6.61
4,2012-01-06,WYKQ2,BG,2004.0,"1,175.00",0.00,"1,175.00","1,175.00",0.0,0.0,8.99
5,2012-01-12,WYKQ2,BG,2004.0,"1,293.00",0.00,"1,293.00","1,280.00",0.0,0.0,18.00

In [47]:
cecx.describe()

,Trade Date,Production Year,Change,Volume (Ton)
count,10360,10360.000000,10360.000000,10360.000000
mean,2012-06-16 21:49:20.617760512,2003.918243,0.010039,24.611573
min,2012-01-02 00:00:00,2002.000000,0.000000,1.800000
25%,2012-03-19 00:00:00,2004.000000,0.000000,6.650000
50%,2012-05-31 00:00:00,2004.000000,0.000000,12.750000
75%,2012-09-18 00:00:00,2004.000000,0.000000,28.050000
max,2012-12-31 00:00:00,2005.000000,45.000000,465.920000
std,NaN,0.350382,0.478211,32.877254

In [11]:
ecx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10362 entries, 0 to 10361
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Trade Date          10361 non-null  datetime64[ns]
 1   Symbol              10361 non-null  object
 2   Warehouse           10361 non-null  object
 3   Production Year     10361 non-null  float64
 4   Opening Price       0 non-null      float64
 5   Closing Price       10361 non-null  object
 6   High                0 non-null      float64
 7   Low                 0 non-null      float64
 8   Change              10361 non-null  float64
 9   Persetntage Change  10361 non-null  object
 10  Volume (Ton)        10361 non-null  float64
dtypes: datetime64[ns](1), float64(6), object(4)
memory usage: 890.6+ KB

In [15]:
ecx['Closing Price'] = ecx['Closing Price'].str.replace(',','.',' ').astype('float64')